var titleTxt = [
	[
        "请输入密码解锁频道",
        "请输入密码：",
        "按 [确认]键解锁，[0~9]键输入，[返回]键删除",
        "温馨提示","密码正确，解锁成功！",
        "密码错误，解锁失败！",
        "当前没有频道！",
        "没有信号",
        "您打开的频道不存在！",
        "请插入智能卡!",
        "请插上网线！",
        "时移"
    ],
	[
        "قۇلۇپلىنىپ قالدى،شىفىرنى كىرگىزۈڭ",
        "شىفىرنى كىرگىزۈڭ:",
        "[confirm] unlock,[0~9] input,[back] delete",
        "ئەسكەرتى ئۇچۇرى",
        "شىفىر بىكىتىش ئۇتۇقلۇق بولدى",
        "مەخپى شىفىر خاتا،قايتا كىرگۈزۈڭ",
        "پروگرامما يوق،ساقلاڭ...",
        "سىگنال يوق",
        "پروگرەمما مەۋجۈت ئەمەس",
        " كارتنى كىرگۈزۈڭ","تورسىمىنى ئۇلاڭ",
        "时移"
    ]
];
