<div class="container company">
  <div class="container-inner">
    <div class="main-bd clearfix">
      <section id="section">
        <h1>关于我们</h1>
        <h4>Who we are? 我们是谁？</h4>
        <ul>
          <li>我们是传统的互联网人，但我们不甘心在传统互联网旧世界的旧秩序下，走着大多数人走过的老路。</li>
          <li>为此，我们聚在一起，在这三网融合、多屏互动的大背景下，注定我们要参与新世界的开拓和新秩序的建立，我们要走一条没人走过的路，虽密布荆棘，但却繁华似锦。</li>
          <li>我们要做互联网时代的墨者，我们追随墨子老人家在科技领域的探索和追求，我们立志于成为未来互联网领域的先行者和开拓者。</li>
        </ul>
        <h4>What we do? 我们做什么？</h4>
        <ul>
          <li>我们专注于跨屏/跨终端（PC、手机、电视、平板电脑、数码相框、MID等各类有屏联网设备）的互联网服务解决方案设计，专注于智能电视/互联网电视上的应用开发及服务提供，专注于围绕电视直播的增值服务提供。</li>
          <li>目前，已和多家知名彩电厂商（TCL、长虹、康佳、东芝等）、电信运营商（中国电信、中国移动等）、广电数字电视运营商（杭州华数、上海百视通等）达成合作，为其互联网电视终端、数字电视机顶盒终端、手持移动设备终端等提供基于三屏一云的、创新的互联网应用和服务。</li>
        </ul>
        <h4>Why Us? 为什么是我们？</h4>
        <dl>
          <dt>我们在传统互联网领域的经验</dt>
          <dd>
            <p>我们在互联网领域有着超过5年以上的从业经验，我们的核心成员都来自知名的互联网企业，不仅对互联网的发展有着深入的理解，更有着大量的经验积累、技术储备。</p>
          </dd>
        </dl>
        <dl>
          <dt>我们在跨终端服务提供方面的经验</dt>
          <dd>
            <p>2年前，随着智能手机的兴起，我们便开始涉足移动互联网，尝试将桌面互联网服务搬上手机终端，通过WAP网站的开发、Sybiam平台、iPhone平台以及Android平台上相关应用的开发，积累了大量跨终端的开发和服务提供经验。</p>
          </dd>
        </dl>
        <dl>
          <dt>我们在智能电视/互联网电视领域的经验</dt>
          <dd>
            <p>从09年下半年开始，我们便尝试进行联网电视领域的应用开发和服务提供，经过一年半的积累，到目前为止，我们在如下各个方面都有了较为长足的进步：</p>
            <ul>
              <li>对电视用户需求的理解：我们联合多家彩电厂商，进行多次入户调研、卖场调研，对电视用户的需求有着深入的理解；</li>
              <li>对客厅交互体验的把握：如何在客厅的公众环境下，在距离屏幕2-3米的距离下，在遥控器的操控性能下，为用户提供卓越的交互体验，我们有着深入的认识；</li>
              <li>在大屏幕电视上设计互联网产品的经验：我们在电视上有着超过10款概念产品的界面设计案例，为我们积累了大量的电视产品设计经验；</li>
              <li>跨平台开发的经验和技术储备：我们有着在长虹、天柏、茁壮等中间件平台上开发的丰富经验，同时也有着Android TV平台上开发的经验和技术储备。</li>
            </ul>
          </dd>
        </dl>
        <dl>
          <dt>我们的渠道优势</dt>
          <dd>
            <ul>
              <li>与家电厂商的紧密合作：目前与长虹、TCL、康佳、东芝等家电厂商达成紧密的战略合作，为其互联网电视产品提供应用开发和后续的内容运营服务；</li>
              <li>与广电数字电视运营商的紧密合作：与杭州华数、江苏广电等建立战略合作关系，为其基于双向数字机顶盒的互联网服务提供开发和运营支持；</li>
              <li>与电信IPTV运营商的紧密合作：与四川电信、上海电信以及上海文广旗下的百事通等建立合作关系，为其基于IPTV机顶盒的互联网服务提供开发和运营支持；</li>
              <li>与中间件平台的紧密合作：与欢网、茁壮、天柏等中间件厂商建立合作关系，在其平台上进行相关产品的移植。</li>
            </ul>
          </dd>
        </dl>
      </section>
<?php include_partial('menu')?>
    </div>
  </div>
</div>
