<div class="container company">
  <div class="container-inner">
    <div class="main-bd clearfix">
      <section id="section">
        <h1>隐私声明</h1>
        <p>我爱电视网（以下简称我爱电视）非常重视对您的个人隐私保护，有时候我们需要某些信息才能为您提供您请求的服务，本隐私声明解释了这些情况下的数据收集和使用情况。
          本隐私声明适用于我爱电视的所有相关服务，随着我爱电视服务范围的扩大，隐私声明的内容可由我爱电视随时更新，且毋须另行通知。更新后的隐私声明一旦在网页上公布即有效代替原来的隐私声明。</p>
        <h4>我们收集哪些信息</h4>
        <p>通常，您能在匿名的状态下访问我爱电视并获取信息。当我们需要能识别您的个人信息或者可以与您联系的信息时，我们会征求您的同意。通常，在您注册我爱电视或申请开通新的功能时，我们可能收集这些信息：姓名，Email地址，住址和电话号码，并征求您的确认。</p>
        <h4>关于您的个人信息</h4>
        <p>我爱电视严格保护您个人信息的安全。我们使用各种安全技术和程序来保护您的个人信息不被未经授权的访问、使用或泄漏。</p>
        <p>我爱电视会在法律要求或符合我爱电视的相关服务条款、软件许可使用协议约定的情况下透露您的个人信息，或者有充分理由相信必须这样做才能：(a) 满足法律或行政法规的明文规定，或者符合我爱电视网站适用的法律程序；（b）符合我爱电视相关服务条款、软件许可使用协议的约定；(c) 保护我爱电视的权利或财产，以及 (d) 在紧急情况下保护我爱电视员工、我爱电视产品或服务的用户或大众的个人安全。</p>
        <p>我爱电视不会未经您的允许将这些信息与第三方共享，本声明已经列出的上述情况除外。</p>
        <h4>Cookie的使用</h4>
        <p>使用 Cookie 能帮助您实现您的联机体验的个性化，您可以接受或拒绝 Cookie ，大多数 Web 浏览器会自动接受 Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。</p>
        <p>我爱电视有时会使用 Cookie 以便知道哪些网站受欢迎，使您在访问我爱电视时能得到更好的服务。Cookie不会跟踪个人信息。</p>
        <p>当您注册我爱电视时，我爱电视亦会使用 Cookie。在这种情况下，我爱电视会收集并存储有用信息，当您再次访问我爱电视时，我们可辨认您的身份。来自我爱电视的 Cookie 只能被我爱电视读取。</p>
        <p>如果您的浏览器被设置为拒绝 Cookie，您仍然能够访问我爱电视的大多数网页。</p>
      </section>
<?php include_partial('menu')?>
    </div>
  </div>
</div>