<?php

class wikiComponents extends sfComponents {

    public function executeAuto_tags() {
        $this->data = array(
            '电视剧' => array(
                    '偶像', '喜剧', '爱情', '都市', '古装', '武侠', '历史',
                    '警匪', '家庭', '神话', '剧情', '犯罪', '情景', '伦理',
                    '悬疑', '军事', '励志', '刑侦', '乡村', '谍战', '宫廷',
                    '商战', '纪实', '科幻', '冒险', '传记', '歌舞', '戏剧',
                    '动作', '战争', '恐怖', '惊悚', '记录',  '枪战','时尚',
                    '温情', '青春', '文艺', '动漫','教育', '灾难', '魔幻',
                    '经典',  '动画','儿童','革命'
					 ),
            '电影' => array(
					 '偶像', '喜剧', '爱情', '都市', '古装', '武侠', '历史',
                    '警匪', '家庭', '神话', '剧情', '犯罪', '情景', '伦理',
                    '悬疑', '军事', '励志', '刑侦', '乡村', '谍战', '宫廷',
                    '商战', '纪实', '科幻', '冒险', '传记', '歌舞', '戏剧',
                    '动作', '战争', '恐怖', '惊悚', '记录',  '枪战','时尚',
                    '温情', '青春', '文艺', '动漫','教育', '灾难', '魔幻',
                    '经典',  '动画','儿童','革命'
                    
                ),
            '体育' => array(
                    '足球','篮球','排球','网球','棒球','台球','冰球','马球',
                    '壁球','门球','垒球','藤球','橄榄球','乒乓球','羽毛球',
                    '高尔夫','曲棍球','沙滩排球','手球','沙滩足球','室内足球',
                    '水球','保龄球','田径','短跑','长跑','F1','游泳','跳水',
                    '赛艇','帆船','帆板皮划艇','花样游泳','龙舟','自行车','马术',
                    '极限运动','摩托艇','滑雪','花样滑冰','健美','健身','健美操',
                    '体操','射击','飞碟','射箭','拳击','跆拳道','击剑','摔跤',
                    '柔道','举重','武术','棋牌运动'
                ),
            '栏目' => array(
                    '影视','综艺','热点','音乐','明星','女性','交友', '谈话',
                   '访谈','情感','曲艺','游戏','益智','搞笑','舞蹈','时尚',
                    '动漫','互动','选秀','竞技','冒险','运动','亲子','奇幻',
                    '校园','教育', '自然','探险','历史','健康','社会','讲坛',
                   '科学','揭秘','军事','百科','股票','理财','金融', '生活',
                    '旅游','购物','新闻','国际','国内','人文','地理','美食',
                    '对话','奇闻','民生','文物','历史','纪录','法制','地方',
                    '纪实','专题', '农业','公益', '职场 '
                   
                )
            );
    }
}