#!/usr/bin/env python26
# -*- coding: utf-8 -*-

__author__="superwen"
__date__ ="$2013-08-07 17:19:10$"

from TvProgramBot.db.myStringFilter import getFilterTitle

s = [
    ['雄风剧场：读心专家 17', '读心专家'],
    ['法治时空 1194', '法治时空'],
    ['海豚万家剧场：爱在旅途Ⅱ 20', '爱在旅途2'],
    ['前情提要《花木兰传奇》37', '花木兰传奇'],
    ['非常6+1(1)', '非常6+1'],
    ['电视剧:穿越烽火线 9', '穿越烽火线'],
    ['传奇 426', '传奇'],
    ['星光大道1/3', '星光大道'],
    ['海豚星光剧场：佳恩别哭 46', '佳恩别哭'],
    ['夜线60分', '夜线60分'],
    ['法治时空 1194', '法治时空'],
    ['2013一起聊聊241', '2013一起聊聊'],
    ['红娘子 43', '红娘子'],
    ['甄嬛传 4','甄嬛传'],
    ['转播中央台新闻联播','新闻联播'],
    ['笑动2013','笑动2013'],
    ['今晚80后脱口秀','今晚80后脱口秀'],
    ['《白领剧场》二集：爱似百汇11―12','爱似百汇'],
    ['英雄剧场：红娘子 22','红娘子'],
    ['动画片：熊出没 73','熊出没'],
    ['巴渝剧场：西游记 37','西游记'],
    ['深夜剧场：甄嬛传 48','甄嬛传'],
    ['东南剧苑：牵牛的夏天 13','牵牛的夏天'],
    ['蓝海影院：家有辣嫂','家有辣嫂'],
    ['雄关剧场：家常菜 6','家常菜'],
    ['花雨剧场：前妻的车站 14','前妻的车站'],
    ['神枪(19)','神枪'],
    ['汉字英雄（重播版）','汉字英雄'],
    ['阳光剧场：爱情公寓Ⅱ','爱情公寓2'],
    ['大王·小王(重播)','大王·小王'],
    ['重播:中国星事记','中国星事记'],
    ['情感剧场：爱情公寓精装版','爱情公寓'],
    ['梦剧场连续剧：血战到底','血战到底'],
    ['12点报道','12点报道'],
    ['黄河大剧院：甄嬛传30','甄嬛传']
]

if __name__ == "__main__":
    for ss in s:
        t,p = getFilterTitle(ss[0])
        if t == ss[1].strip():
            print t,"\t","+++"
        else:
            print t,"\t",ss[1]