<div class="container company">
  <div class="container-inner">
    <div class="main-bd clearfix">
      <section id="section">
        <h1>使用协议</h1>
        <h4>1、接受条款</h4>
        <p>我爱电视网（以下简称“我爱电视”）根据以下服务条款为您提供服务。这些条款可由我爱电视随时更新，且毋须另行通知。我爱电视使用协议（以下简称“使用协议”）一旦发生变动，我爱电视将在网页上公布修改内容。修改后的使用协议一旦在网页上公布即有效代替原来的使用协议。此外，当您使用我爱电视特殊服务时，您和我爱电视应遵守我爱电视随时公布的与该服务相关的指引和规则。前述所有的指引和规则，均构成本使用协议的一部分。</p>
        <p>您在使用我爱电视提供的各项服务之前，应仔细阅读本使用协议。如您不同意本使用协议及/或随时对其的修改，请您立即停止使用我爱电视网所提供的全部服务；您一旦使用我爱电视服务，即视为您已了解并完全同意本使用协议各项内容，包括我爱电视对使用协议随时所做的任何修改，并成为我爱电视用户（以下简称“用户”）。</p>
        <h4>2、服务说明</h4>
        <p>我爱电视目前向用户提供如下服务：发布并分享对图书、电影、音乐的评论；收藏图书、电影、音乐；在我爱电视中发布话题、日记、上传图片；在同城中发布或参加各类活动。除非本使用协议另有其它明示规定，增加或强化目前本服务的任何新功能，包括所推出的新产品，均受到本使用协议之规范。您了解并同意，本服务仅依其当前所呈现的状况提供，对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，我爱电视均不承担任何责任。我爱电视保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。</p>
        <h4>3、遵守法律</h4>
        <p>您同意遵守中华人民共和国相关法律法规的所有规定，并对以任何方式使用您的密码和您的帐号使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，有可能构成犯罪的，将被追究刑事责任，并由您承担全部法律责任。</p>
        <p>同时如果我爱电视有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反国家法律和法规的任何规定，我爱电视可在任何时候不经任何事先通知终止向您提供服务。</p>
        <h4>4、您的注册义务</h4>
        <p>为了能使用本服务，您同意以下事项：依本服务注册提示请您填写正确的注册邮箱、密码和名号，并确保今后更新的登陆邮箱、名号、头像等资料的有效性和合法性。若您提供任何违法、不道德或我爱电视认为不适合在我爱电视上展示的资料；或者我爱电视有理由怀疑你的资料属于程序或恶意操作，我爱电视有权暂停或终止您的帐号，并拒绝您于现在和未来使用本服务之全部或任何部分。</p>
        <p>我爱电视无须对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。</p>
        <h4>5、我爱电视隐私权政策</h4>
        <p>您提供的登记资料及我爱电视保留的有关您的若干其它资料将受到中国有关隐私的法律和本公司《隐私声明》之规范。</p>
        <h4>6、一般条款</h4>
        <ul>
          <li>本使用协议、社区指导原则和免责声明构成您与我爱电视之全部协议，并规范您对于本服务之使用行为。在您使用相关服务、使用第三方提供的内容或软件时，亦应遵从所适用之附加条款及条件；</li>
          <li>本使用协议及您与我爱电视之关系，均受到中华人民共和国法律管辖。您与我爱电视就本服务、本使用协议或其它有关事项发生的争议，应首先友好协商解决，协商不成时应提请中国国际经济贸易仲裁委员会仲裁，仲裁裁决是终局性的，对双方均有约束力；</li>
          <li>我爱电视未行使或执行本使用协议任何权利或规定，不构成对前述权利或权利之放弃；</li>
          <li>倘本使用协议之任何规定因与中华人民共和国法律抵触而无效，您依然同意应依照法律，努力使该规定所反映之当事人意向具备效力，且本使用协议其它规定仍应具有完整的效力及效果；</li>
          <li>本使用协议之标题仅供方便而设，不具任何法律或契约效果；</li>
          <li>我爱电视对本使用协议享有最终解释权。</li>
        </ul>
      </section>
      <aside id="aside">
        <div class="company-menu">
          <ul>
            <li><a href="@@about.html">关于我们</a></li>
            <li><a href="@@disclaimer.html">免责声明</a></li>
            <li><a href="@@privacy.html">隐私声明</a></li>
            <li><a href="@@partner.html">合作伙伴</a></li>
            <li><a href="@@employ.html">诚聘英才</a></li>
            <li><a href="@@contact.html">联系我们</a></li>
            <li><a href="@@help.html">帮助中心</a></li>
            <li><a href="@@agreement.html" class="active">使用协议</a></li>
          </ul>
          <div class="backhome"><a href="index.html">返回首页</a></div>
        </div>
      </aside>
    </div>
  </div>
</div>